'''
练习3:水仙花数是指一个n位数（n>=3），它的每个位上的数字的n次幂之和等于它本身（例如:1**3 + 5**3 + 3**3 = 153）
'''

'''
操作步骤:

1、求出1000以内所有的三位数(变量i) -- (因为水仙花数是三位数及其以上)
i = 100
while i < 1000:
    i += 1
    print(i)

2、创建变量a,b,c,获取三位数上的每一位的数
a = i // 100
b = (i % 100) // 10
c = i % 10

3、判断三位数的位上的数的三次幂是否等于这个三位数，是的话输出
if a**3 + b**3 + c**3 == i:
    print(j)
'''

i = 100
while i < 1000:
    a = i // 100
    b = (i % 100) // 10
    c = i % 10
    if a**3 + b**3 + c**3 == i:
        print(i)
    i += 1