'''
例1:
    打印出如下图形
        *****
        *****
        *****
        *****
        *****
'''

'''
解法1:使用最简单的“笨方法”:
print('*****')
print('*****')
print('*****')
print('*****')
print('*****')
'''

'''
解法2:使用while语句循环嵌套
'''
'''
# 外层循环控制高度
i = 0
while i < 5:
    # 内层循环控制宽度
    j =0 
    while j < 5:
        print('*',end='')
        j += 1
    print()
    i += 1
'''

'''
例2:
    打印出以下图形
        *          j<1   i=0
        **         j<2   i=1
        ***        j<3   i=2
        ****       j<4   i=3
        *****      j<5   i=4
'''
# 外层循环控制高度
i = 0
while i < 5:
    # 内层循环控制宽度
    j = 0
    while j < i+1:
        print('*',end='')
        j += 1
    print()
    i += 1